---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
InitialWattageIntensity Constructor
InitialWattageIntensity Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | InitialWattageIntensity(InitialWattageIntensity) | Creates a copy of the given initial wattage intensity object |
|  | InitialWattageIntensity(Double, Double) | Creates an initial wattage intensity object with the given values. |

# See Also

InitialWattageIntensity Class

InitialWattageIntensity Members

Autodesk.Revit.DB.Lighting Namespace